## **Dados Utilizados nas Consultas - MER**

### Categorias de Vendas

In [4]:
import pandas as pd

df_vendas = pd.read_csv(r'C:\Users\jamil\OneDrive\Área de Trabalho\SQL\arquivos\vendas.csv')
df_vendas

,ID_VENDA,DATA_VENDA,ID_LOJA,ID_DEPARTAMENTO,ID_CATEGORIA,QUANTIDADE,VALOR_TOTAL
0,1,2023-01-01,1,1,1,2,600.50
1,2,2023-01-02,1,2,2,1,150.00
2,3,2023-01-03,1,3,3,3,450.75
3,4,2023-01-04,1,1,2,2,320.20
4,5,2023-01-05,1,2,3,1,220.10
...,...,...,...,...,...,...,...
95,96,2023-04-26,2,3,3,3,800.00
96,97,2023-04-27,2,1,1,1,150.00
97,98,2023-04-28,2,2,2,2,400.00
98,99,2023-04-29,2,3,3,1,250.00
99,100,2023-04-30,2,1,1,3,500.00

### Vendas

In [12]:
df_vendas = pd.read_csv(r'C:\Users\jamil\OneDrive\Área de Trabalho\SQL\arquivos\vendas.csv')
df_vendas

,ID_VENDA,DATA_VENDA,ID_LOJA,ID_DEPARTAMENTO,ID_CATEGORIA,QUANTIDADE,VALOR_TOTAL
0,1,2023-01-01,1,1,1,2,600.50
1,2,2023-01-02,1,2,2,1,150.00
2,3,2023-01-03,1,3,3,3,450.75
3,4,2023-01-04,1,1,2,2,320.20
4,5,2023-01-05,1,2,3,1,220.10
...,...,...,...,...,...,...,...
95,96,2023-04-26,2,3,3,3,800.00
96,97,2023-04-27,2,1,1,1,150.00
97,98,2023-04-28,2,2,2,2,400.00
98,99,2023-04-29,2,3,3,1,250.00
99,100,2023-04-30,2,1,1,3,500.00

### Estoque

In [6]:
df_estoque = pd.read_csv(r'C:\Users\jamil\OneDrive\Área de Trabalho\SQL\arquivos\estoque.csv')
df_estoque

    ID_ESTOQUE  ID_LOJA  ID_DEPARTAMENTO  ID_CATEGORIA  QUANTIDADE_DISPONÍVEL
0            1        1                1             1                     50
1            2        1                2             2                     30
2            3        1                3             3                     40
3            4        1                1             2                     25
4            5        1                2             3                     15
..         ...      ...              ...           ...                    ...
95          96        1                3             1                     55
96          97        2                1             2                     35
97          98        2                2             3                     50
98          99        2                3             1                     40
99         100        2                1             2                     45

[100 rows x 5 columns]

### Salarios por Departamentos

In [7]:
df_salario_departamentos = pd.read_csv(r'C:\Users\jamil\OneDrive\Área de Trabalho\SQL\arquivos\salarios.csv')
df_salario_departamentos

   ID_SAL_DEP  ID_DEPARTAMENTO  SALARIO_MEDIO
0           1                1         4500.0
1           2                2         3800.0
2           3                3         3200.0

## Lojas

In [8]:
df_lojas = pd.read_csv(r'C:\Users\jamil\OneDrive\Área de Trabalho\SQL\arquivos\lojas.csv')
df_lojas

   ID_LOJA     NOME_LOJA LOCALIZACAO
0        1  Loja Central      Centro
1        2    Loja Norte       Norte
2        3      Loja Sul         Sul

## **Definindo os Casos de Uso das Consultas:**

In [14]:
import pandas as pd
import duckdb


con = duckdb.connect()

result = con.execute("SELECT * FROM df_vendas").fetchdf()

print(result)

    ID_VENDA  DATA_VENDA  ID_LOJA  ID_DEPARTAMENTO  ID_CATEGORIA  QUANTIDADE  \
0          1  2023-01-01        1                1             1           2
1          2  2023-01-02        1                2             2           1
2          3  2023-01-03        1                3             3           3
3          4  2023-01-04        1                1             2           2
4          5  2023-01-05        1                2             3           1
..       ...         ...      ...              ...           ...         ...
95        96  2023-04-26        2                3             3           3
96        97  2023-04-27        2                1             1           1
97        98  2023-04-28        2                2             2           2
98        99  2023-04-29        2                3             3           1
99       100  2023-04-30        2                1             1           3

    VALOR_TOTAL
0        600.50
1        150.00
2        450.75
3        320.20
4        220.10
..          ...
95       800.00
96       150.00
97       400.00
98       250.00
99       500.00

[100 rows x 7 columns]